
#include	"iodefine.h"
#include	"common.h"
#include	"drv.h"

/************************************************/
/*	LEDドライバ（右）			(drv_led_r)		*/
/************************************************/
/*	右LEDの点灯/消灯を行う。					*/
/*----------------------------------------------*/
/*	IN :int i_stat … LED_OFF(0):消灯			*/
/*					  LED_ON (1):点灯			*/
/************************************************/
void drv_led_r(int i_stat)
{
	//LEDドライバ（右）
	LED_R = i_stat;
}

/************************************************/
/*	LEDドライバ（左）			(drv_led_l)		*/
/************************************************/
/*	左LEDの点灯/消灯を行う。					*/
/*----------------------------------------------*/
/*	IN :int i_stat … LED_OFF(0):消灯			*/
/*					  LED_ON (1):点灯			*/
/************************************************/
void drv_led_l(int i_stat)
{
	//LEDドライバ（左）
	LED_L = i_stat;
}

/************************************************/
/*	LEDドライバ（前右）			(drv_led_fr)	*/
/************************************************/
/*	前右LEDの点灯/消灯を行う。					*/
/*----------------------------------------------*/
/*	IN :int i_stat … LED_OFF(0):消灯			*/
/*					  LED_ON (1):点灯			*/
/************************************************/
void drv_led_fr(int i_stat)
{
	//LEDドライバ（前右）
	LED_FR = i_stat;
}

/************************************************/
/*	LEDドライバ（前左）			(drv_led_fl)	*/
/************************************************/
/*	前左LEDの点灯/消灯を行う。					*/
/*----------------------------------------------*/
/*	IN :int i_stat … LED_OFF(0):消灯			*/
/*					  LED_ON (1):点灯			*/
/************************************************/
void drv_led_fl(int i_stat)
{
	//LEDドライバ（前左）
	LED_FL = i_stat;
}

/************************************************/
/*	スイッチドライバ（青）			(drv_sw_b)	*/
/************************************************/
/*	青スイッチの状態を読んで返す。				*/
/*----------------------------------------------*/
/*	RET:unsiged char	… 青スイッチの状態		*/
/*					       ON:SW_ON(0)			*/
/************************************************/
unsigned char drv_sw_b(void)
{
	//スイッチドライバ（青）
	drv_wait_ms(CHAT_WAIT);		//チャタリング防止のためWAIT
	//スイッチを読み込む
	return SW_BLUE;
}

/************************************************/
/*	スイッチドライバ（黄）			(drv_sw_y)	*/
/************************************************/
/*	黄スイッチの状態を読んで返す。				*/
/*----------------------------------------------*/
/*	RET:unsiged char	… 黄スイッチの状態		*/
/*					       ON:SW_ON(0)			*/
/************************************************/
unsigned char drv_sw_y(void)
{
	//スイッチドライバ（黄）
	drv_wait_ms(CHAT_WAIT);		//チャタリング防止のためWAIT
	//スイッチを読み込む
	return SW_YELLOW;
}

/************************************************/
/*	スイッチドライバ（赤）			(drv_sw_r)	*/
/************************************************/
/*	赤スイッチの状態を読んで返す。				*/
/*----------------------------------------------*/
/*	RET:unsiged char	… 赤スイッチの状態		*/
/*					       ON:SW_ON(0)			*/
/************************************************/
unsigned char drv_sw_r(void)
{
	//スイッチドライバ（赤）
	drv_wait_ms(CHAT_WAIT);		//チャタリング防止のためWAIT
	//スイッチを読み込む
	return SW_RED;
}

/************************************************/
/*	ブザードライバ				(drv_bz)		*/
/************************************************/
/*	周波数、時間(ms)を指定してブザーを鳴らす。	*/
/*----------------------------------------------*/
/*	IN :int   i_freq   … 周波数				*/
/*		int	  i_ms     … 時間(ms)				*/
/************************************************/
void drv_bz(int i_freq, int i_ms)
{
	//ブザードライバ
	float cycle;
	float pulsWidth;
	//
	if (i_freq == 0)
	{
		//Wait
		drv_wait_ms(i_ms);
	}
	else
	{
		//周波数を設定
		cycle = (float)MTU_BZ_CLOCK / (float)i_freq;
		pulsWidth = cycle / 2.0;
		MTU_BZ_CYCLE = (short)cycle;
		MTU_BZ_PULSWIDTH = (short)pulsWidth;
		//発振
		MTU22.TCNT = 0;
		MTU_BZ = BZ_ON;			//ブザーの発振を開始
		drv_wait_ms(i_ms);		//指定時間 待つ
		MTU_BZ = BZ_OFF;		//ブザーの発振を終了
	}
}

/************************************************/
/*	ウェイト					(drv_wait_ms)	*/
/************************************************/
/*	ms単位で待ち時間を生成する。				*/
/*----------------------------------------------*/
/*	IN :int i_ms … 待ち時間(ms)				*/
/************************************************/
void drv_wait_ms(int i_ms)
{
	//ms単位で待ち時間を生成する。
	int startCount;
	//
	startCount =G_TimerCount;
	//
	while((G_TimerCount - startCount) < i_ms);
}

